{
  "HomePage": {
    "title": "Expert in all types of legal cases",
    "company_name": "THONGRAKNITISRI CO LTD.",
    "title2": "We are committed to providing the highest standards of legal services to protect the interests of our clients.",
    "consultation": "Legal consultation",
    "allservice": "All our services"
  },
  "History": {
    "title": "Our History",
    "companyName": "Thongrak Nitisri Co., Ltd. ",
    "foundedText": "was established in 2019, initially opening as",
    "formerName": "Pongsit Law Office",
    "description": "formed by a team of 3 expert lawyers and 1 professional legal execution staff. With a vision of providing comprehensive and highly professional legal expertise, we are dedicated to delivering end-to-end services. This ranges from in-depth legal consultation, analysis, planning, and dispute resolution to reviewing and drafting all types of business agreements, license applications, issuing debt collection notices, various certificates, and foreign document notarization. We also serve as legal counsel in civil, criminal, anti-corruption, administrative, and labor cases, as well as estate administrator appointments, asset tracing, and legal execution to ensure our clients receive the maximum benefit.",
    "readMore": "Read More",
    "certificateTitle": "Lawyer Man Law Office Certificate",
    "certificateSubtitle": "(Lawyers Council under the Royal Patronage)",
    "consultButton": "Legal Consultation"
  },
  "Vision": {
    "title": "Vision",
    "description": "“Striving to be a leading law firm providing comprehensive, professional services to clients of all nationalities, to sustainably elevate the standards and image of the Thai legal profession to an international level.”",
    "mission": "Mission",
    "title1": "Comprehensive Services",
    "description1": "Committed to delivering legal services covering all dimensions, from preventive strategies to complete dispute resolution and problem-solving. This includes consultation, contract drafting and review, litigation, as well as full-scale asset tracing and execution.",
    "title2": "Excellence as Litigation Leaders",
    "description2": "Elevating the organization to become an international legal leader, with particular expertise in litigation and case management that emphasizes sharpness, accuracy, and full professional ethics.",
    "title3": "Trusted Partner",
    "description3": "Standing firm as a strong and reliable legal partner to protect the interests and build sustainable success for clients of all nationalities with utmost sincerity."
  },
  "Service": {
    "company_name": "THONGRAKNITISRI CO LTD.",
    "title": "The best legal services",
    "description": "We help our clients remain competitive in the evolving legal landscape",
    "our": "Our",
    "service": "Services",
    "details": "more details",
    "other": "Other",
    "service2": "Services",
    "ourservice": "Our Service",
    "view": "View More"
  },
  "Experience": {
    "company_name": "THONGRAKNITISRI CO LTD.",
    "our": "Experience",
    "our2": "Experience",
    "experience": "Our",
    "details": "more details",
    "view": "View More",
    "service": "The best legal services",
    "help": "We help our clients remain competitive in the evolving legal landscape",
    "other": "Experience"
  },
  "Article": {
    "company_name": "THONGRAKNITISRI CO LTD.",
    "service": "The best legal services",
    "help": "We help our clients remain competitive in the evolving legal landscape",
    "article": "Our",
    "our": "Article",
    "details": "more details"
  },
  "WhyWe": {
    "why": "Why choose us ?"
  },
  "AboutUs": {
    "company_name": "THONGRAKNITISRI CO LTD.",
    "about": "About",
    "us": "Us",
    "service": "The best legal services",
    "help": "We help our clients remain competitive in the evolving legal landscape",
    "contract": "Contract Us",
    "contract2": "Contact Legal Consultation",
    "history": "Founding",
    "founding": "History",
    "p1": "was founded in 2019 by a group of 7 expert lawyers and 2 professional legal execution staff. With a vision committed to being a comprehensive and highly professional legal representative, we intend to deliver services covering everything from in-depth legal consultation, analysis, and preventive planning for potential future disputes, to reviewing and drafting all types of business agreements, processing complex licenses, and debt collection. Furthermore, we represent clients in civil, criminal, and labor cases, as well as in arbitration processes, including specialized expertise in asset tracing and legal execution to ensure the maximum benefit for our clients.",
    "p2": "With many years of accumulated legal experience, our legal team has built trust through expertise in various fields of law, particularly in complex civil, commercial, and criminal cases involving substantial asset values. Our outstanding ability to analyze difficult cases and strategize litigation meticulously and tightly at every step ensures that our services are highly effective, exceeding international standards, and capable of excellently protecting our clients' interests.",
    "p3": "We also adhere to the principle of equality and are committed to providing legal services to all clients with the highest professional ethics. We are ready to serve without discrimination based on race or background, because our primary goal is to be a widely accepted legal representative whose legal success is continuously recommended by word of mouth. This drives our company forward to become a leading international law firm standing firm on righteousness and justice.",
    "our": "Our",
    "team": "team",
    "view": "more details",
    "details": "more details"
  },
  "Footer": {
    "address1": "102/8 Moo 5, Nong Chabok Subdistrict, Mueang Nakhon Ratchasima District, Nakhon Ratchasima 30000",
    "address2": "199/70 Moo 4, Bang Duea Subdistrict, Mueang District, Pathum Thani 12000",
    "contract": "Contact legal services",
    "ourservice": "Our Service",
    "trust": "Trust us, we'll stand by your side",
    "reslove": "Resolve legal issues professionally",
    "contractus": "Contact Us",
    "protect": "Protect the interests of all our clients"
  },
  "Contact": {
    "company_name": "THONGRAKNITISRI CO LTD.",
    "service": "The best legal services",
    "help": "We help our clients remain competitive in the evolving legal landscape",
    "contact": "Contact",
    "us": "Us",
    "form_title": "Contact Us Form",
    "form_fname": "First Name",
    "form_lname": "Last Name",
    "form_email": "Email",
    "form_phone": "Phone Number",
    "form_details": "Details",
    "form_submit": "Submit",
    "address": "4, 4/5 Central Tower, 12th Fl., Ratchadamri Rd., Pathum Wan, Pathum Wan, Bangkok, Thailand 10330",
    "location": "Location",
    "contact_legal": "Legal Service Contact",
    "email_label": "Email"
  },
  "Customer": {
    "our": "Our",
    "customer": "Customer"
  },
  "Payment": {
    "rates": "Price rates",
    "currency": "THB",
    "pay": "Payment ",
    "prompay": "* 100% Secure PromptPay Payment",
    "Steps": {
      "add_friend": "Add Friend",
      "payment": "Payment",
      "submit_proof": "Submit Proof/Case"
    },
    "StepTitles": {
      "step1": "Step 1: Add us on LINE and send your proof of transfer with case details to meet your consultant.",
      "step2": "Step 2: Pay the specified amount.",
      "step3": "Step 3: Please save a screenshot of the slip as proof to verify your identity and open a case file."
    },
    "AddFriend": {
      "line_id": "LINE ID: @THONGRAKLAW"
    },
    "Transfer": {
      "bank_name": "Kasikornbank",
      "account_name": "Mr. Pongsit Thongrak",
      "amount_to_pay": "Amount to pay",
      "currency": "THB",
      "warning": "Please verify the amount is correct before confirming the transfer and clicking next."
    },
    "Final": {
      "proof_of_transfer": "Proof of transfer",
      "slip": "Slip",
      "consultant_name": "Consultant Name:",
      "client_fullname": "Full Name [Specify client name]",
      "client_nickname": "Nickname [Specify nickname]",
      "client_phone": "Phone Number [Specify phone number]",
      "footer_note": "Our staff will contact you back within 24 hours. Thank you for trusting us."
    },
    "Footer": {
      "cancel": "Cancel",
      "back": "Back",
      "finish": "Finish",
      "next": "Next"
    }
  }
}
