{
  "HomePage": {
    "title": "เชี่ยวชาญทุกคดีความ",
    "company_name": "บริษัท ทองรักนิติศรี จำกัด",
    "title2": "มุ่งมั่นการบริการทางกฎหมายที่ได้มาตรฐานสูงสุด เพื่อรักษาผลประโยชน์ของลูกความ",
    "consultation": "ปรึกษากฎหมาย",
    "allservice": "บริการเราทั้งหมด"
  },
  "History": {
    "title": "ประวัติการก่อตั้ง",
    "companyName": "บริษัท ทองรักนิติศรี จำกัด",
    "foundedText": "ก่อตั้งขึ้นเมื่อปี พ.ศ. 2562 โดยเปิดเป็นสำนักงานกฎหมาย",
    "formerName": " Pongsit Law Office ",
    "description": "โดยการรวมตัวของทีมทนายความผู้เชี่ยวชาญจำนวน 3 ท่าน และทีมงานด้านการบังคับคดีมืออาชีพอีก 1 ท่าน ภายใต้วิสัยทัศน์มีความรู้ในด้านกฎหมาย ที่ให้บริการแบบครบวงจรและเปี่ยมด้วยความเป็นมืออาชีพพวกเราตั้งใจที่จะส่งมอบบริการที่ครอบคลุมตั้งแต่ขั้นตอนการให้คำปรึกษาทาง กฎหมายเชิงลึก การวิเคราะห์และวางแผน และแก้ปัญหาข้อพิพาทต่างๆที่อาจเกิดขึ้นแล้วได้การตรวจสอบและร่างข้อตกลงทางธุรกิจ ทุกประเภทการดำเนินการขอใบอนุญาตออกหนังสือทวงถามหนี้ หนังสือรับรองต่างๆ และหนังสือรับรองเอกสารต่างประเทศ ตลอดจนการทำหน้าที่ว่า ความในคดีแพ่ง คดีอาญา คดีอาญาทุจริต คดีปกครอง คดีแรงงานและ การขอตั้งผู้จัดการมรดก รวมถึงการสืบหา ทรัพย์สินและการบังคับคดีเพื่อให้ลูกความได้รับผลประโยชน์สูงสุด",
    "readMore": "อ่านเพิ่มเติม",
    "certificateTitle": "หนังสือรับรอง สำนักงานกฎหมายลอว์เยอร์แมน",
    "certificateSubtitle": "(สภาทนายความในพระบรมราชูปถัมภ์)",
    "consultButton": "ปรึกษากฎหมาย"
  },
  "Vision": {
    "title": "วิสัยทัศน์",
    "description": "“มุ่งสู่การเป็นสำนักงานกฎหมายที่เป็นแนวหน้า ที่ให้บริการครบวงจรด้วยความเป็นมืออาชีพแก่ลูกความ ทุกเชื้อชาติ เพื่อยกระดับมาตรฐานและภาพลักษณ์วิชาชีพ กฎหมายไทยที่เป็นสากลอย่างยั่งยืน”",
    "mission": "พันธกิจ",
    "title1": "การให้บริการที่ครบวงจร",
    "description1": "มุ่งมั่นส่งมอบบริการทางกฎหมายที่ครอบคลุมทุกมิติ ตั้งแต่การวางกลยุทธ์เชิงป้องกัน ไปจนถึงการระงับข้อพิพาทและแก้ไขปัญหาอย่างเบ็ดเสร็จ ไม่ว่าจะเป็นการให้คำปรึกษา การร่างและตรวจสอบสัญญา การว่าความในศาลตลอดจน สืบทรัพย์และการบังคับคดีอย่างเต็มรูปแบบ",
    "title2": "ความเป็นเลิศในฐานะผู้นำด้านการว่าความ",
    "description2": "ยกระดับองค์กรสู่การเป็นผู้นำด้านกฎหมายระดับ สากล โดยเฉพาะความเชี่ยวชาญในการว่าความและการดำเนินคดีที่เน้นความเฉียบคม แม่นยำ และเปี่ยมด้วยจรรยาบรรณวิชาชีพ",
    "title3": "พันธมิตรที่ไว้วางใจได้",
    "description3": "ยืนหยัดในฐานะพันธมิตรทางกฎหมายที่แข็งแกร่งและน่าเชื่อถือเพื่อ ปกป้องผลประโยชน์และสร้างความสำเร็จที่ยั่งยืนให้แก่ลูกความทุกเชื้อชาติด้วยความจริงใจ"
  },
  "Service": {
    "company_name": "บริษัท ทองรักนิติศรี จำกัด",
    "title": "บริการทางกฎหมายที่ดีที่สุด",
    "description": "เราช่วยให้ลูกค้ายังคงสามารถแข่งขันได้ในภูมิทัศน์ทางกฎหมายที่เปลี่ยนแปลงไป",
    "our": "บริการ",
    "service": "ของเรา",
    "details": "ดูรายละเอียด",
    "other": "บริการ",
    "service2": "อื่นๆ",
    "ourservice": "บริการของเรา",
    "view": "ดูทั้งหมด"
  },
  "Experience": {
    "our": "บริการ",
    "experience": "ประสบการณ์",
    "details": "ดูรายละเอียด",
    "view": "ดูทั้งหมด"
  },
  "WhyWe": {
    "why": "ทำไมต้องเลือกพวกเรา ?"
  },
  "AboutUs": {
    "company_name": "บริษัท ทองรักนิติศรี จำกัด",
    "about": "เกี่ยวกับ",
    "us": "เรา",
    "service": "บริการทางกฎหมายที่ดีที่สุด",
    "help": "เราช่วยให้ลูกค้ายังคงสามารถแข่งขันได้ในภูมิทัศน์ทางกฎหมายที่เปลี่ยนแปลงไป",
    "contract": "ติดต่อเรา",
    "history": "ประวัติ",
    "founding": "การก่อตั้ง",
    "p1": "ก่อตั้งขึ้นเมื่อปี พ.ศ. 2562 โดยการรวมตัวของทีมทนายความผู้เชี่ยวชาญจำนวน 7 ท่าน และทีมงานด้านการบังคับคดีมืออาชีพอีก 2 ท่าน ภายใต้วิสัยทัศน์ที่มุ่งมั่นจะเป็นตัวแทนทางด้านกฎหมายที่ให้บริการแบบครบวงจรและเปี่ยมด้วยความเป็นมืออาชีพ พวกเราตั้งใจที่จะส่งมอบบริการที่ครอบคลุมตั้งแต่ขั้นตอนการให้คำปรึกษาทางกฎหมายเชิงลึก การวิเคราะห์และวางแนวทางป้องกันปัญหาข้อพิพาทต่างๆ ที่อาจเกิดขึ้นในอนาคต การตรวจสอบและร่างข้อตกลงทางธุรกิจทุกประเภท การดำเนินการขอใบอนุญาตที่ซับซ้อน การติดตามทวงถามหนี้ ตลอดจนการทำหน้าที่ว่าความในคดีแพ่ง คดีอาญา คดีแรงงานและกระบวนการอนุญาโตตุลาการ รวมถึงความเชี่ยวชาญเฉพาะทางในการสืบหาทรัพย์สินและการบังคับคดีเพื่อให้ลูกความได้รับผลประโยชน์สูงสุด",
    "p2": "ด้วยประสบการณ์ทางกฎหมายที่สั่งสมมาอย่างยาวนานหลายปี ทีมทนายความของเราได้สร้างความเชื่อมั่นผ่านความเชี่ยวชาญในข้อกฎหมายที่หลากหลาย โดยเฉพาะอย่างยิ่งในด้านกฎหมายแพ่งและพาณิชย์และกฎหมายอาญาที่มีความซับซ้อนซึ่งเกี่ยวข้องกับมูลค่าทรัพย์สินจำนวนมหาศาล ความสามารถอันโดดเด่นของเราในการวิเคราะห์รูปคดีที่ยากต่อการจัดการ และการวางกลยุทธ์ในการดำเนินคดีอย่างละเอียดรอบคอบและรัดกุมในทุกขั้นตอน ทำให้มั่นใจได้ว่าบริการของเราจะมีประสิทธิภาพในระดับสูงกว่ามาตรฐานสากลและสามารถรักษาผลประโยชน์ของลูกความได้อย่างยอดเยี่ยม",
    "p3": "พวกเรายังยึดมั่นในหลักการแห่งความเท่าเทียมและมุ่งมั่นที่จะให้บริการทางกฎหมายแก่ลูกความทุกท่านด้วยจรรยาบรรณวิชาชีพสูงสุด พวกเราพร้อมให้บริการโดยไม่แบ่งแยกเชื้อชาติหรือภูมิหลังของลูกความ เพราะเป้าหมายสำคัญของเราคือการเป็นตัวแทนทางกฎหมายที่ลูกความให้การยอมรับอย่างกว้างขวาง และบอกต่อถึงความสำเร็จทางด้านกฎหมายของพวกเราอย่างต่อเนื่อง เพื่อผลักดันให้บริษัทของเราก้าวสู่การเป็นสำนักงานกฎหมายระหว่างประเทศชั้นนำในระดับสากลที่ยืนหยัดอยู่บนความถูกต้องและความยุติธรรม",
    "our": "ทีม",
    "team": "ของเรา",
    "view": "ดูเพิ่มเติม"
  },
  "Footer": {
    "address1": "102/8 หมู่ 5 ตำบล หนองจะบก อำเภอเมืองนครราชสีมา จังหวัดนครราชสีมา 30000",
    "address2": "199/70 หมู่ 4 ตำบล บางเดื่อ อำเภอเมือง จังหวัดปทุมธานี 12000",
    "contract": "ติดต่อบริการด้านกฎหมาย",
    "ourservice": "บริการของเรา",
    "trust": "ไว้ใจเรา พร้อมยืนหยัดเคียงข้างคุณ",
    "reslove": " แก้ไขปัญหาทางกฎหมายอย่างมืออาชีพ",
    "contractus": "ปกป้องผลประโยชน์ของลูกความทุกท่าน",
    "protect": "ติดต่อเรา"
  },
  "Customer": {
    "our": "ลูกค้า",
    "customer": "ของเรา"
  }
}
