import Pic1 from "@/public/History.webp";
import Service01 from "@/public/Service/Civil litigation.webp";
import Service02 from "@/public/Service/Criminal representation.webp";
import Service03 from "@/public/Service/Visa and Work Permit.webp";
import Service04 from "@/public/Service/Legal and Business Consultant.webp";
import Service05 from "@/public/Service/Land Law Consultation.webp";
import Service06 from "@/public/Service/Bail Bonding.webp";
import Service07 from "@/public/Service/Enforcement of Judgments.webp";
import Service08 from "@/public/Service/Domestic Permit Application.webp";
import Service09 from "@/public/Service/Foreign Marriage Registration.webp";
import Service10 from "@/public/Service/Construction Work.webp";
import Service11 from "@/public/Service/Public Notary.webp";
import Service12 from "@/public/Service/Various Contracts.webp";
import Service13 from "@/public/Service/Various Consultations.webp";
import Service14 from "@/public/Service/Strange Problem Consultation.webp";

import { StaticImageData } from "next/image";

export interface ServiceItem {
  serviceId: number;
  title?: string;
  title_th?: string;
  title_en?: string;
  title2?: string;
  title2_th?: string;
  title2_en?: string;
  article?: string;
  price?: number;
  href?: string;
  image?: string | StaticImageData;
  imageService?: string | StaticImageData;
  [key: string]: string | number | StaticImageData | undefined;
}

export const serviceData = [
  {
    serviceId: 1,
    imageService: Service01,
    title_th: "การว่าความคดีแพ่ง",
    title_en: "Civil litigation",
    title2_th: "การว่าความอยู่ที่ 1500 บาท",
    title2_en: "The legal representation fee is 1500 baht.",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "Test",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 2,
    imageService: Service02,
    title_th: "การว่าความคดีอาญา",
    title_en: "Criminal representation",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 3,
    imageService: Service03,
    title_th: "วีซ่าและใบอนุญาตทำงาน",
    title_en: "Visa and Work Permit",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    href: "/visa-workpermit",
    image: Pic1,
  },
  {
    serviceId: 4,
    imageService: Service04,
    title_th: "ที่ปรึกษาทางกฎหมายและธุรกิจ",
    title_en: "Legal and Business Consultant",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 5,
    imageService: Service05,
    title_th: "ปรึกษากฎหมายที่ดิน",
    title_en: "Land Law Consultation",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 6,
    imageService: Service06,
    title_th: "การประกันตัว",
    title_en: "Bail Bonding",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 7,
    imageService: Service07,
    title_th: "การบังคับคดี",
    title_en: "Enforcement of Judgments",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 8,
    imageService: Service08,
    title_th: "การขอใบอนุญาตภายในประเทศไทย",
    title_en: "Domestic Permit Application",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 9,
    imageService: Service09,
    title_th: "จดทะเบียนสมรสกับต่างชาติ",
    title_en: "Foreign Marriage Registration",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 10,
    imageService: Service10,
    title_th: "งานก่อสร้าง",
    title_en: "Construction Work",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 11,
    imageService: Service11,
    title_th: "โนตารีพับลิค (หนังสือรับรองต่างประเทศ)",
    title_en: "Public Notary (Foreign Certificates)", 
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 12,
    imageService: Service12,
    title_th: "หนังสือสัญญาต่างๆ",
    title_en: "Various Contracts",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 13,
    imageService: Service13,
    title_th: "ปรึกษาเรื่องต่างๆ",
    title_en: "Various Consultations",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 14,
    imageService: Service14,
    title_th: "ปรึกษาปัญหาแปลกๆ",
    title_en: "Strange Problem Consultation",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article_th:
      "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    article_en: "",
    price: 1500,
    image: Pic1,
  },
];
