import Pic1 from "@/public/History.jpg";

import { StaticImageData } from "next/image"; 

export interface ServiceItem {
  serviceId: number;
  title: string;
  image?: string | StaticImageData
  article: string;
  price?: number; 
  title2?: string; 
  href?: string;
}

export const serviceData = [
  {
    serviceId: 1,
    title: "การว่าความคดีแพ่ง",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article: "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 2,
    title: "การว่าความคดีอาญา",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article: "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 3,
    title: "วีซ่าและใบอนุญาตทำงาน",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article: "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    price: 1500,
    href: "/visa-workpermit",
    image: Pic1,
  },
  {
    serviceId: 4,
    title: "ที่ปรึกษาทางกฎหมายและธุรกิจ",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article: "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 5,
    title: "การประกันตัว",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article: "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 6,
    title: "การบังคับคดี",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article: "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    price: 1500,
  },
  {
    serviceId: 7,
    title: "การขอใบอนุญาตภายในประเทศไทย",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article: "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    price: 1500,
    image: Pic1,
  },
  {
    serviceId: 8,
    title: "กฎหมายที่ดิน",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article: "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    image: Pic1,
  },
  {
    serviceId: 9,
    title: "หนังสือสัญญาต่างๆ",
    title2: "การว่าความอยู่ที่ 1500 บาท",
    article: "ในด้านข้อพิพาททางกฎหมาย การดำเนินคดีแพ่งมีบทบาทสำคัญในการแก้ไขความขัดแย้งระหว่างบุคคล ธุรกิจ และ หน่วยงานอื่นๆ สำนักงานกฎหมายของเราให้บริการด้านการดำเนินคดีแพ่งอย่างครอบคลุม ซึ่งออกแบบมาเพื่อปกป้องสิทธิและผลประโยชน์ของคุณ เรามุ่งมั่นที่จะให้คำแนะนำเชิงกลยุทธ์ การเป็นตัวแทนที่มีประสิทธิภาพ และบริการส่วน บุคคลตลอดทุกขั้นตอนของกระบวนการดำเนินคดี บริการด้านการดำเนินคดีแพ่งของเรา ประกอบด้วย",
    price: 1500,
    image: Pic1,
  },
];
