export interface TeamMember {
  aboutId: number;
  name_th: string;
  name_en: string;
  role_th: string;
  role_en: string;
  image: string;
  bio_th: string;
  bio_en: string;
  [key: string]: string | number | undefined;
}

export const teamData = [
  {
    aboutId: 1,
    name_th: "นายพงษ์สิทธิ์ ทองรักษ์",
    name_en: "Test",
    role_th: "ผู้ก่อตั้งและหุ้นส่วนผู้จัดการ",
    role_en: "ผู้ก่อตั้งและหุ้นส่วนผู้จัดการ",
    image: "/team-1.webp",
    bio_th: `นายพงษ์สิทธิ์ ทองรักษ์ ไม่เพียงแต่เป็นทนายความผู้มากประสบการณ์ 
    แต่เขายังเป็นที่รู้จักในฐานะผู้เชี่ยวชาญด้านกฎหมายอาญา 
    และเป็นทนายความให้กับธุรกิจรถซูเปอร์คาร์และธุรกิจทวงถามหนี้
    เขามีส่วนร่วมในฐานะทนายความที่อยู่เบื้องหลังคดีที่เป็นข่าวโด่งดังหลายคดี
    และเขาเป็นที่ปรึกษากฎหมายที่น่าเชื่อถือของเหล่านักธุรกิจชั้นนำ`,
    bio_en: `นายพงษ์สิทธิ์ ทองรักษ์ ไม่เพียงแต่เป็นทนายความผู้มากประสบการณ์ 
    แต่เขายังเป็นที่รู้จักในฐานะผู้เชี่ยวชาญด้านกฎหมายอาญา 
    และเป็นทนายความให้กับธุรกิจรถซูเปอร์คาร์และธุรกิจทวงถามหนี้
    เขามีส่วนร่วมในฐานะทนายความที่อยู่เบื้องหลังคดีที่เป็นข่าวโด่งดังหลายคดี
    และเขาเป็นที่ปรึกษากฎหมายที่น่าเชื่อถือของเหล่านักธุรกิจชั้นนำ`,
  },
  {
    aboutId: 2,
    name_th: "นายภาณุวัฒน์ เชิญชู",
    name_en: "นายภาณุวัฒน์ เชิญชู",
    role_th: "ทนายอาวุโส",
    role_en: "ทนายอาวุโส",
    image: "/User03.webp",
    bio_th:
      "ทนายความอาวุโสที่มีความเชี่ยวชาญด้านกฎหมายแพ่งและพาณิชย์ รวมถึงการวางแผนมรดก...",
    bio_en:
      "ทนายความอาวุโสที่มีความเชี่ยวชาญด้านกฎหมายแพ่งและพาณิชย์ รวมถึงการวางแผนมรดก...",
  },
  {
    aboutId: 3,
    name_th: "นางสาวสุรีย์รัตน์ ขิยะภัทร์",
    name_en: "นางสาวสุรีย์รัตน์ ขิยะภัทร์",
    role_th: "ทนาย",
    role_en: "ทนาย",
    image: "/User02.webp",
    bio_th:
      "เชี่ยวชาญด้านการว่าความในคดีครอบครัวและการเจรจาไกล่เกลี่ยข้อพิพาทระดับสากล...",
    bio_en:
      "เชี่ยวชาญด้านการว่าความในคดีครอบครัวและการเจรจาไกล่เกลี่ยข้อพิพาทระดับสากล...",
  },
  {
    aboutId: 4,
    name_th: "นายณัฐวุฒิ โต๊ะสิงห์",
    name_en: "นายณัฐวุฒิ โต๊ะสิงห์",
    role_th: "ที่ปรึกษา",
    role_en: "ที่ปรึกษา",
    image: "/User04.webp",
    bio_th:
      "ที่ปรึกษาด้านกฎหมายธุรกิจและการลงทุนระหว่างประเทศ มีประสบการณ์การทำงานกับบริษัทข้ามชาติ...",
    bio_en:
      "ที่ปรึกษาด้านกฎหมายธุรกิจและการลงทุนระหว่างประเทศ มีประสบการณ์การทำงานกับบริษัทข้ามชาติ...",
  },
];
